In [189]:
import numpy as np 
import pandas as pd
import os
import warnings
warnings.filterwarnings('ignore')
from sklearn import linear_model
from sklearn.linear_model import LogisticRegression
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import SVC
from sklearn.svm import SVR
from sklearn.model_selection import GridSearchCV
import pandas_profiling

In [190]:
pwd = os.getcwd()
print(pwd)

C:\Users\IQBALE\ClassRoom\Hackathons

In [191]:
data_train = pd.read_csv('Titanic_train.csv')
data_test = pd.read_csv('Titanic_test.csv')

In [192]:
data_train.shape

(891, 12)

In [193]:
data_test.shape

(418, 11)

In [194]:
data = pd.concat([data_train,data_test],axis=0)

In [195]:
data.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450

In [196]:
data.isna().sum()

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

In [197]:
#pandas_profiling.ProfileReport(data)

In [198]:
data.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket'],
      dtype='object')

In [199]:
data.Pclass.unique()

array([3, 1, 2], dtype=int64)

In [200]:
data.Pclass.dtype

dtype('int64')

In [201]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
Age            1046 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Fare           1308 non-null float64
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       891 non-null float64
Ticket         1309 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 132.9+ KB

In [202]:
data.isna().sum()

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

In [203]:
data['Age'].groupby(data['Pclass']).mean()

Pclass
1    39.159930
2    29.506705
3    24.816367
Name: Age, dtype: float64

In [204]:
data['Age'] = data['Age'].groupby(data['Pclass']).transform(lambda x: x.fillna(x.mean()))

In [205]:
data['Age'].groupby(data['Pclass']).mean()

Pclass
1    39.159930
2    29.506705
3    24.816367
Name: Age, dtype: float64

In [206]:
data['Age'].isna().sum()

0

In [207]:
data.isna().sum()

Age               0
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

In [208]:
data.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450

In [209]:
data['Embarked'] = data['Embarked'].groupby(data['Pclass']).transform(lambda x: x.fillna(x.mode()[0]))

In [210]:
data['Fare'] = data['Fare'].groupby(data['Pclass']).transform(lambda x: x.fillna(x.mode()[0]))

In [211]:
data.isna().sum()

Age               0
Cabin          1014
Embarked          0
Fare              0
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

In [212]:
data.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket'],
      dtype='object')

In [213]:
cat_cols = [ 'Embarked', 'Parch', 'Pclass', 'Sex','SibSp','Survived']

In [214]:
for i in cat_cols:
    data[i] = data[i].astype('category')

In [215]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
Age            1309 non-null float64
Cabin          295 non-null object
Embarked       1309 non-null category
Fare           1309 non-null float64
Name           1309 non-null object
Parch          1309 non-null category
PassengerId    1309 non-null int64
Pclass         1309 non-null category
Sex            1309 non-null category
SibSp          1309 non-null category
Survived       891 non-null category
Ticket         1309 non-null object
dtypes: category(6), float64(2), int64(1), object(3)
memory usage: 120.4+ KB

In [216]:
data_in = data.drop(['Cabin', 'Fare', 'Name', 'Ticket'],axis=1)

In [217]:
data_in.head()

    Age Embarked Parch  PassengerId Pclass     Sex SibSp Survived
0  22.0        S     0            1      3    male     1      0.0
1  38.0        C     0            2      1  female     1      1.0
2  26.0        S     0            3      3  female     0      1.0
3  35.0        S     0            4      1  female     1      1.0
4  35.0        S     0            5      3    male     0      0.0

In [218]:
data_in

           Age Embarked Parch  PassengerId Pclass     Sex SibSp Survived
0    22.000000        S     0            1      3    male     1      0.0
1    38.000000        C     0            2      1  female     1      1.0
2    26.000000        S     0            3      3  female     0      1.0
3    35.000000        S     0            4      1  female     1      1.0
4    35.000000        S     0            5      3    male     0      0.0
..         ...      ...   ...          ...    ...     ...   ...      ...
413  24.816367        S     0         1305      3    male     0      NaN
414  39.000000        C     0         1306      1  female     0      NaN
415  38.500000        S     0         1307      3    male     0      NaN
416  24.816367        S     0         1308      3    male     0      NaN
417  24.816367        C     1         1309      3    male     1      NaN

[1309 rows x 8 columns]

In [219]:
data_in.columns

Index(['Age', 'Embarked', 'Parch', 'PassengerId', 'Pclass', 'Sex', 'SibSp',
       'Survived'],
      dtype='object')

In [220]:
data_cat = data_in.drop(['Age', 'Survived','PassengerId'],axis = 1 )

In [221]:
data_cat.head()

  Embarked Parch Pclass     Sex SibSp
0        S     0      3    male     1
1        C     0      1  female     1
2        S     0      3  female     0
3        S     0      1  female     1
4        S     0      3    male     0

In [222]:
data_cat = pd.get_dummies(data_cat)

In [223]:
data_cat.head()

,Embarked_C,Embarked_Q,Embarked_S,Parch_0,Parch_1,Parch_2,Parch_3,Parch_4,Parch_5,Parch_6,...,Pclass_3,Sex_female,Sex_male,SibSp_0,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,SibSp_8
0,0,0,1,1,0,0,0,0,0,0,...,1,0,1,0,1,0,0,0,0,0
1,1,0,0,1,0,0,0,0,0,0,...,0,1,0,0,1,0,0,0,0,0
2,0,0,1,1,0,0,0,0,0,0,...,1,1,0,1,0,0,0,0,0,0
3,0,0,1,1,0,0,0,0,0,0,...,0,1,0,0,1,0,0,0,0,0
4,0,0,1,1,0,0,0,0,0,0,...,1,0,1,1,0,0,0,0,0,0

In [224]:
data_clean = pd.concat([data_cat,data_in['Age'],data_in['Survived'],data_in['PassengerId']],axis = 1)

In [225]:
data_clean.head()

,Embarked_C,Embarked_Q,Embarked_S,Parch_0,Parch_1,Parch_2,Parch_3,Parch_4,Parch_5,Parch_6,...,SibSp_0,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,SibSp_8,Age,Survived,PassengerId
0,0,0,1,1,0,0,0,0,0,0,...,0,1,0,0,0,0,0,22.0,0.0,1
1,1,0,0,1,0,0,0,0,0,0,...,0,1,0,0,0,0,0,38.0,1.0,2
2,0,0,1,1,0,0,0,0,0,0,...,1,0,0,0,0,0,0,26.0,1.0,3
3,0,0,1,1,0,0,0,0,0,0,...,0,1,0,0,0,0,0,35.0,1.0,4
4,0,0,1,1,0,0,0,0,0,0,...,1,0,0,0,0,0,0,35.0,0.0,5

In [226]:
data_test = data_clean[data_clean.Survived.isna()]
data_train = data_clean[data_clean.Survived.notna()]

In [227]:
data_test_PassengerId = data_test.pop('PassengerId')

In [228]:
data_test_PassengerId.head()

0    892
1    893
2    894
3    895
4    896
Name: PassengerId, dtype: int64

In [229]:
data_test.head()

,Embarked_C,Embarked_Q,Embarked_S,Parch_0,Parch_1,Parch_2,Parch_3,Parch_4,Parch_5,Parch_6,...,Sex_male,SibSp_0,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,SibSp_8,Age,Survived
0,0,1,0,1,0,0,0,0,0,0,...,1,1,0,0,0,0,0,0,34.5,NaN
1,0,0,1,1,0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,47.0,NaN
2,0,1,0,1,0,0,0,0,0,0,...,1,1,0,0,0,0,0,0,62.0,NaN
3,0,0,1,1,0,0,0,0,0,0,...,1,1,0,0,0,0,0,0,27.0,NaN
4,0,0,1,0,1,0,0,0,0,0,...,0,0,1,0,0,0,0,0,22.0,NaN

In [230]:
data_test.shape

(418, 25)

In [231]:
data_test.pop('Survived')

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
413   NaN
414   NaN
415   NaN
416   NaN
417   NaN
Name: Survived, Length: 418, dtype: category
Categories (2, float64): [0.0, 1.0]

In [232]:
data_test.head()

,Embarked_C,Embarked_Q,Embarked_S,Parch_0,Parch_1,Parch_2,Parch_3,Parch_4,Parch_5,Parch_6,...,Sex_female,Sex_male,SibSp_0,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,SibSp_8,Age
0,0,1,0,1,0,0,0,0,0,0,...,0,1,1,0,0,0,0,0,0,34.5
1,0,0,1,1,0,0,0,0,0,0,...,1,0,0,1,0,0,0,0,0,47.0
2,0,1,0,1,0,0,0,0,0,0,...,0,1,1,0,0,0,0,0,0,62.0
3,0,0,1,1,0,0,0,0,0,0,...,0,1,1,0,0,0,0,0,0,27.0
4,0,0,1,0,1,0,0,0,0,0,...,1,0,0,1,0,0,0,0,0,22.0

In [233]:
data_test.shape

(418, 24)

In [234]:
data_train.shape

(891, 26)

In [235]:
y= data_train.pop('Survived')

In [236]:
data_train.pop('PassengerId')

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64

In [237]:
data_train.head()

,Embarked_C,Embarked_Q,Embarked_S,Parch_0,Parch_1,Parch_2,Parch_3,Parch_4,Parch_5,Parch_6,...,Sex_female,Sex_male,SibSp_0,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,SibSp_8,Age
0,0,0,1,1,0,0,0,0,0,0,...,0,1,0,1,0,0,0,0,0,22.0
1,1,0,0,1,0,0,0,0,0,0,...,1,0,0,1,0,0,0,0,0,38.0
2,0,0,1,1,0,0,0,0,0,0,...,1,0,1,0,0,0,0,0,0,26.0
3,0,0,1,1,0,0,0,0,0,0,...,1,0,0,1,0,0,0,0,0,35.0
4,0,0,1,1,0,0,0,0,0,0,...,0,1,1,0,0,0,0,0,0,35.0

In [238]:
y.head()

0    0.0
1    1.0
2    1.0
3    1.0
4    0.0
Name: Survived, dtype: category
Categories (2, float64): [0.0, 1.0]

In [239]:
data_test.shape

(418, 24)

In [263]:
data_test_PassengerId

0    892
1    893
2    894
3    895
4    896
Name: PassengerId, dtype: int64

In [240]:
X_train ,X_test,y_train,y_test = train_test_split(data_train,y,test_size=0.3,random_state=100)

In [241]:
LM = LogisticRegression()
LM.fit(X_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [242]:
LM.score(X_test,y_test)

0.8134328358208955

In [243]:
LM.score(X_train,y_train)

0.8218298555377207

In [244]:
RF = RandomForestClassifier()
RF.fit(X_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=10,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [245]:
RF.score(X_test,y_test)

0.8059701492537313

In [254]:
NoofEstimator = [5, 10, 15, 20]
MinSampleLeaf = [1, 3, 5, 7]
MaxFeature = np.arange(0.1, 1.1, 0.1)
best_score = []

for i in NoofEstimator:
    for j in MinSampleLeaf:
        for k in MaxFeature:
            result = [i, j, k]
            rfc = RandomForestClassifier(n_estimators = i, min_samples_leaf = j, max_features = k,random_state = 100) # (can be used)
            rfc.fit(X_train, y_train)
            result.append(rfc.score(X_train, y_train))
            result.append(rfc.score(X_test, y_test))
            if len(best_score) == 0:
                best_score = result
            elif best_score[4] < result[4]:
                best_score = result
                print(best_score)

[5, 1, 0.2, 0.9149277688603531, 0.7985074626865671]
[5, 1, 0.30000000000000004, 0.9213483146067416, 0.8059701492537313]
[5, 1, 0.5, 0.9197431781701445, 0.8283582089552238]

In [ ]:
# Below are the hyper parameters which gives most accurate results ... 
[5, 1, 0.5, 0.9197431781701445, 0.8283582089552238]

In [255]:
rfc = RandomForestClassifier(n_estimators = 5, min_samples_leaf = 1, max_features = 0.5) #random_state = 100 (can be used)
rfc.fit(X_train, y_train)
print(rfc.score(X_test, y_test))
titanic_predict = rfc.predict(data_test)

0.8208955223880597

In [260]:
print(titanic_predict[:])

[0. 0. 1. 1. 0. 0. 0. 0. 1. 0. 0. 0. 1. 1. 1. 1. 0. 0. 1. 0. 1. 0. 1. 1.
 1. 0. 1. 0. 0. 0. 0. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 0. 0. 1. 1. 0. 0. 0.
 1. 0. 1. 0. 1. 1. 0. 0. 0. 0. 0. 1. 0. 0. 0. 1. 0. 1. 1. 0. 1. 1. 1. 0.
 1. 1. 1. 1. 0. 1. 0. 1. 1. 0. 0. 0. 0. 1. 1. 0. 1. 1. 0. 0. 1. 0. 0. 0.
 1. 0. 0. 0. 1. 0. 0. 0. 1. 0. 0. 0. 0. 0. 0. 1. 1. 1. 1. 0. 0. 1. 0. 1.
 1. 0. 1. 0. 0. 1. 0. 1. 0. 0. 1. 0. 0. 1. 0. 0. 0. 0. 0. 0. 0. 1. 1. 0.
 1. 0. 0. 0. 0. 0. 1. 0. 0. 0. 0. 0. 1. 0. 1. 1. 1. 0. 1. 0. 0. 0. 0. 0.
 1. 1. 0. 0. 0. 0. 0. 1. 1. 1. 1. 1. 0. 1. 1. 0. 1. 0. 1. 0. 0. 0. 0. 0.
 0. 1. 1. 0. 1. 0. 0. 0. 1. 1. 1. 1. 0. 0. 0. 0. 1. 0. 1. 0. 0. 1. 0. 1.
 1. 0. 1. 0. 1. 0. 1. 0. 1. 0. 0. 1. 0. 0. 0. 1. 1. 0. 1. 0. 1. 0. 1. 1.
 1. 1. 1. 0. 0. 0. 1. 0. 1. 0. 1. 0. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 1. 1.
 0. 0. 0. 0. 0. 0. 0. 0. 1. 1. 0. 1. 0. 0. 0. 0. 0. 1. 1. 1. 1. 0. 0. 1.
 0. 0. 0. 0. 0. 0. 0. 0. 1. 0. 0. 0. 1. 0. 0. 0. 1. 1. 0. 1. 0. 0. 0. 0.
 0. 0. 1. 1. 1. 0. 1. 0. 0. 0. 0. 0. 1. 0. 1. 0. 0. 0. 1. 0. 0. 1. 1. 0.
 0. 0. 0. 0. 0. 1. 0. 1. 0. 0. 0. 1. 0. 1. 1. 0. 0. 0. 1. 0. 1. 0. 0. 0.
 0. 1. 1. 1. 1. 0. 1. 1. 1. 0. 0. 1. 0. 0. 1. 1. 0. 0. 0. 1. 0. 0. 0. 1.
 0. 1. 0. 0. 0. 0. 0. 1. 0. 0. 0. 1. 0. 1. 0. 0. 1. 0. 1. 0. 1. 0. 0. 1.
 1. 1. 1. 1. 1. 0. 1. 0. 0. 1.]

In [265]:
Titanic_submission = pd.DataFrame({'PassengerId': data_test_PassengerId , 'Survived': titanic_predict })

In [266]:
Titanic_submission.head

   PassengerId  Survived
0          892       0.0
1          893       0.0
2          894       1.0
3          895       1.0
4          896       0.0

In [269]:
Titanic_submission.to_csv('Titanic_gender_submission.csv',index=False)

In [248]:
X_train.head()

,Embarked_C,Embarked_Q,Embarked_S,Parch_0,Parch_1,Parch_2,Parch_3,Parch_4,Parch_5,Parch_6,...,Sex_female,Sex_male,SibSp_0,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,SibSp_8,Age
69,0,0,1,1,0,0,0,0,0,0,...,0,1,0,0,1,0,0,0,0,26.00000
85,0,0,1,1,0,0,0,0,0,0,...,1,0,0,0,0,1,0,0,0,33.00000
794,0,0,1,1,0,0,0,0,0,0,...,0,1,1,0,0,0,0,0,0,25.00000
161,0,0,1,1,0,0,0,0,0,0,...,1,0,1,0,0,0,0,0,0,40.00000
815,0,0,1,1,0,0,0,0,0,0,...,0,1,1,0,0,0,0,0,0,39.15993

In [249]:
c = [1.0, 0.25, 0.5, 0.75]
kernels = ['linear', 'rbf']
gammas = ['auto', 0.01, 0.001, 1] #1/n_feature

svm = SVC()

grid_svm = GridSearchCV(estimator = svm, param_grid = dict(kernel = kernels, C = c, gamma = gammas), cv = 5)
grid_svm.fit(X_train, y_train)
print('The best hyperparamters: ', grid_svm.best_estimator_)

The best hyperparamters:  SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='auto', kernel='linear',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [250]:
svc_model = SVC(C = 1, gamma='auto', kernel='linear')
svc_model.fit(X_train, y_train)

print('The train accuracy', svc_model.score(X_train, y_train))
print('The test accuracy', svc_model.score(X_test, y_test))

The train accuracy 0.8025682182985554
The test accuracy 0.7798507462686567